{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Написать программу «справочник».Создать два списка\n",
    "целых. Один список хранит идентификационные коды,\n",
    "второй — телефонные номера. Реализовать меню для\n",
    "пользователя:\n",
    "■ Отсортировать по идентификационным кодам;\n",
    "■ Отсортировать по номерам телефона;\n",
    "■ Вывести список пользователей с кодами и телефонами;\n",
    "■ Выход."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей\n",
      "4. Выход\n",
      "\n",
      "Список пользователей:\n",
      "ID: 101, Телефон: 5551234\n",
      "ID: 203, Телефон: 5555678\n",
      "ID: 102, Телефон: 5552345\n",
      "ID: 305, Телефон: 5556789\n",
      "ID: 104, Телефон: 5553456\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей\n",
      "4. Выход\n",
      "\n",
      "Список отсортирован по номерам телефона.\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей\n",
      "4. Выход\n",
      "\n",
      "Список отсортирован по идентификационным кодам.\n",
      "\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей\n",
      "4. Выход\n",
      "Некорректный ввод. Попробуйте снова.\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей\n",
      "4. Выход\n",
      "Некорректный ввод. Попробуйте снова.\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей\n",
      "4. Выход\n",
      "Некорректный ввод. Попробуйте снова.\n",
      "Меню:\n",
      "1. Отсортировать по идентификационным кодам\n",
      "2. Отсортировать по номерам телефона\n",
      "3. Вывести список пользователей\n",
      "4. Выход\n",
      "Выход из программы.\n"
     ]
    }
   ],
   "source": [
    "# Инициализация списков\n",
    "ids = [101, 203, 102, 305, 104]\n",
    "phones = [5551234, 5555678, 5552345, 5556789, 5553456]\n",
    "\n",
    "# Функция для вывода списка пользователей\n",
    "def show_users(ids, phones):\n",
    "    print(\"\\nСписок пользователей:\")\n",
    "    for user_id, phone in zip(ids, phones):\n",
    "        print(f\"ID: {user_id}, Телефон: {phone}\")\n",
    "    print()\n",
    "\n",
    "# Функция для сортировки по идентификационным кодам\n",
    "def sort_by_ids(ids, phones):\n",
    "    sorted_pairs = sorted(zip(ids, phones))\n",
    "    return [pair[0] for pair in sorted_pairs], [pair[1] for pair in sorted_pairs]\n",
    "\n",
    "# Функция для сортировки по номерам телефона\n",
    "def sort_by_phones(ids, phones):\n",
    "    sorted_pairs = sorted(zip(phones, ids))\n",
    "    return [pair[1] for pair in sorted_pairs], [pair[0] for pair in sorted_pairs]\n",
    "\n",
    "# Главное меню\n",
    "def main():\n",
    "    global ids, phones\n",
    "    while True:\n",
    "        print(\"Меню:\")\n",
    "        print(\"1. Отсортировать по идентификационным кодам\")\n",
    "        print(\"2. Отсортировать по номерам телефона\")\n",
    "        print(\"3. Вывести список пользователей\")\n",
    "        print(\"4. Выход\")\n",
    "        choice = input(\"Введите номер операции: \")\n",
    "\n",
    "        if choice == \"1\":\n",
    "            ids, phones = sort_by_ids(ids, phones)\n",
    "            print(\"\\nСписок отсортирован по идентификационным кодам.\\n\")\n",
    "        elif choice == \"2\":\n",
    "            ids, phones = sort_by_phones(ids, phones)\n",
    "            print(\"\\nСписок отсортирован по номерам телефона.\\n\")\n",
    "        elif choice == \"3\":\n",
    "            show_users(ids, phones)\n",
    "        elif choice == \"4\":\n",
    "            print(\"Выход из программы.\")\n",
    "            break\n",
    "        else:\n",
    "            print(\"Некорректный ввод. Попробуйте снова.\")\n",
    "\n",
    "if __name__ == \"__main__\":\n",
    "    main()\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
